presentation.org
* Who Am I? [0/4]

- [ ] David Clark

- [ ] GitHub: https://github.com/dwclark

- [ ] Work: Principal Engineer, Research Now https://www.researchnow.com/ (we are hiring, come watch me yell at people, make a fool of myself, but also do some cool Groovy code)

- [ ] Project: http-builder-ng, https://github.com/dwclark/http-builder-ng. Replacement for the aging HTTPBuilder. Modern Groovy DSL for doing anything http related

* 2 Fast 2 Furious [0/5]

  - [ ] Objection #1: Why should I care about this stuff? Computers just get faster!
    
    - The free lunch is over. Free speedups come from increasing clock speeds, optimizing execution inside the CPU, and increasing the size of the CPU cache. Only CPU caches are getting bigger.

    - When was the last time you bought a computer that was faster than the one you last bought?
      
  - [ ] Objection #2: Isn't this just a matter of choosing the right algorithm?
    
    - Algorithm complexity does determine execution speed to a large degree

    - However, algorithm complexity always ignores constant factors

    - Those constant factors can be really high

    - A lot of this talk is about reducing those constant factors

  - [ ] Objection #3: Won't the JVM optimize this stuff for me?

    - The JVM will optimize a lot of stuff, but it can't work miracles

    - A lot of this talk is about getting groovy out of the way of the JVM so it can optimize

    - A lot of the rest of this talk is about using groovy to help the JVM do its job

  - [ ] Objection #4: My application doesn't need to go faster!

    - If this is the case then by all means ignore everything in this talk, move on to your next task

    - But, a lot of applications that are "fast enough" really are not. "Fast enough" is often a lie we tell ourselves because we don't know how to solve the problem.

    - Faster often opens up new use cases for your code. Everyone hated source code control before git. Now git is used by everyone and it has changed how we as programmers work. A lot of this has to do with how fast git is. The concepts of merging and branching were well understoof before git, but people avoided them because they were slow. Now everyone branches and merges several times a day, mostly because git is fast.

  - [ ] Objection #5: Groovy is just inherently slow, don't bother.

    - Claim: If you give me a java project I can make it at least as fast or faster by adding Groovy. In some sense this is an empty claim, I can give you back the project as is and it's just as fast as it was. However, I do think that adding Groovy can increase both clarity and speed.

    - Most of what I have done over the past 3 years is write performance critical code, and I always reach for Groovy.

* Assumptions [0/5]

- [ ] You actually have a performance problem

- [ ] You know how to measure application performance and how to measure improvements

- [ ] You know the basics of algorithm complexity (O(n) notation)

- [ ] You know the basics of how the JVM operates and what makes for fast executing code

- [ ] If you don't know these things no worries, you will still hopefully get a lot out of this talk, just be careful about applying these techniques. In other words, don't run out and add @CompileStatic to all of your code. Depending on your application it may not actually go any faster and may make your code worse.

- [ ] However, even if these things don't apply, you should still be able to get a lot out of this talk

* Performance?? [0/3]

- [ ] This is a hard talk to give

  - Performance is a black art

  - Everything has an exception

  - Intuitions are wrong very often

  - Every application is different, very hard to generalize anything

- [ ] We are going to be talking about computation based performance. We want to squeeze as much performance out of the CPU as possible.

- [ ] This assumes you are doing no I/O operations: no sockets, no DB calls, no file operations

  - Performance problems here are usually easier to diagnose and fix

  - Usually it means using threads to parallelize operations and then minimizing thread context switches

  - Alternately, it means using asynchronous I/O will callbacks or promises to parallelize operations

