presentation.tex
% Created 2016-09-07 Wed 17:26
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{David Clark}
\date{\today}
\title{Groovy Performance: Avoid the Bad, Use the Good, Create the Great}
\hypersetup{
 pdfauthor={David Clark},
 pdftitle={Groovy Performance: Avoid the Bad, Use the Good, Create the Great},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Who Am I? [0/4]}
\label{sec:orgheadline1}

\begin{itemize}
\item $\square$ David Clark

\item $\square$ GitHub: \url{https://github.com/dwclark}

\item $\square$ Work: Principal Engineer, Research Now \url{https://www.researchnow.com/} (we are hiring, come watch me yell at people, make a fool of myself, but also do some cool Groovy code)

\item $\square$ Project: http-builder-ng, \url{https://github.com/dwclark/http-builder-ng}. Replacement for the aging HTTPBuilder. Modern Groovy DSL for doing anything http related
\end{itemize}

\section{2 Fast 2 Furious [0/5]}
\label{sec:orgheadline2}

\begin{itemize}
\item $\square$ Objection \#1: Why should I care about this stuff? Computers just get faster!

\begin{itemize}
\item The free lunch is over. Free speedups come from increasing clock speeds, optimizing execution inside the CPU, and increasing the size of the CPU cache. Only CPU caches are getting bigger.

\item When was the last time you bought a computer that was faster than the one you last bought?
\end{itemize}

\item $\square$ Objection \#2: Isn't this just a matter of choosing the right algorithm?

\begin{itemize}
\item Algorithm complexity does determine execution speed to a large degree

\item However, algorithm complexity always ignores constant factors

\item Those constant factors can be really high

\item A lot of this talk is about reducing those constant factors
\end{itemize}

\item $\square$ Objection \#3: Won't the JVM optimize this stuff for me?

\begin{itemize}
\item The JVM will optimize a lot of stuff, but it can't work miracles

\item A lot of this talk is about getting groovy out of the way of the JVM so it can optimize

\item A lot of the rest of this talk is about using groovy to help the JVM do its job
\end{itemize}

\item $\square$ Objection \#4: My application doesn't need to go faster!

\begin{itemize}
\item If this is the case then by all means ignore everything in this talk, move on to your next task

\item But, a lot of applications that are "fast enough" really are not. "Fast enough" is often a lie we tell ourselves because we don't know how to solve the problem.

\item Faster often opens up new use cases for your code. Everyone hated source code control before git. Now git is used by everyone and it has changed how we as programmers work. A lot of this has to do with how fast git is. The concepts of merging and branching were well understoof before git, but people avoided them because they were slow. Now everyone branches and merges several times a day, mostly because git is fast.
\end{itemize}

\item $\square$ Objection \#5: Groovy is just inherently slow, don't bother.

\begin{itemize}
\item Claim: If you give me a java project I can make it at least as fast or faster by adding Groovy. In some sense this is an empty claim, I can give you back the project as is and it's just as fast as it was. However, I do think that adding Groovy can increase both clarity and speed.

\item Most of what I have done over the past 3 years is write performance critical code, and I always reach for Groovy.
\end{itemize}
\end{itemize}

\section{Assumptions [0/5]}
\label{sec:orgheadline3}

\begin{itemize}
\item $\square$ You actually have a performance problem

\item $\square$ You know how to measure application performance and how to measure improvements

\item $\square$ You know the basics of algorithm complexity (O(n) notation)

\item $\square$ You know the basics of how the JVM operates and what makes for fast executing code

\item $\square$ If you don't know these things no worries, you will still hopefully get a lot out of this talk, just be careful about applying these techniques. In other words, don't run out and add @CompileStatic to all of your code. Depending on your application it may not actually go any faster and may make your code worse.

\item $\square$ However, even if these things don't apply, you should still be able to get a lot out of this talk
\end{itemize}

\section{Performance?? [0/3]}
\label{sec:orgheadline4}

\begin{itemize}
\item $\square$ This is a hard talk to give

\begin{itemize}
\item Performance is a black art

\item Everything has an exception

\item Intuitions are wrong very often

\item Every application is different, very hard to generalize anything
\end{itemize}

\item $\square$ We are going to be talking about computation based performance. We want to squeeze as much performance out of the CPU as possible.

\item $\square$ This assumes you are doing no I/O operations: no sockets, no DB calls, no file operations

\begin{itemize}
\item Performance problems here are usually easier to diagnose and fix

\item Usually it means using threads to parallelize operations and then minimizing thread context switches

\item Alternately, it means using asynchronous I/O will callbacks or promises to parallelize operations
\end{itemize}
\end{itemize}
