presentation.org
* Groovy Gotchas (Avoid the Bad) [0/9]

- [ ] Much fewer than there used to be. For the most part compiled static Groovy code is about as performant as Java code.

  - Java 8 is a big win for groovy. Java 8 is very agressive about inlining code.

  - I used to recommend against using arrays directly in Groovy. Once hotspot has optimized a method there is no difference between Groovy and Java array access. This is acutally quite shocking.

  - I used to also have concerns about reference equality in Groovy. I don't remember why, but it also is compiled to the same byte codes as on the JVM.

- [ ] Gotcha #1: Boxing/Unboxing

  - Implicit box/unbox operations can really slow down a hot inner loop.

  - How much of a slow down? I've seen 3x slowdown.

  - However, this isn't really Groovy specific because Java has the same problem.

  - See fastUtils in Groovy class.

- [ ] Gotcha #2: Implcit casting

  - Boxing/unboxing is really just a special case of this.

  - Groovy tends to be much slower about casts because it has to hook into asType().

  - This applies even to primitive casts. Bottom line: avoid casts in hot spots if necessary.

  - Amazingly enough, any type of non-exact match causes this problem. Even assigning to references of a super class, for instance see Groovy.referenceEquals()

- [ ] Gotcha #3: Meta Class based dispatch

  - propertyMissing/methodMissing/invokeMethod are just plain slow. You also can't use them with @CompileStatic or @TypeChecked

  - This also shows up in builders that tend to be implemented through propertyMissing/methodMissing/invokeMethod. However this is usually a case of it not mattering. 99% of the time time after I use a builder I save a the data to disk or send it out of a socket. I/O is orders of magnitude slower than in VM processing and will usually swamp the execution time of the builder.

  - Grails and Gradle have both moved away from these implementation techniques to increase performance

- [ ] Gotcha #4: Inner classes

  - Non-static inner classes "work" but are not natural in groovy and lead to surprising behavior. Some of these are lower performance due to accessing methods and properties via reflection, i.e. slow code.

  - Solution: Use static inner classes for speed and encapsulation or use closures.

- [ ] Gotcha #5: Switch statements

  - Groovy switch statements are SIGNIFICANTLY slower than Java versions. In simple tests. dispatching on integers, Java is 50x faster. Why?

  - Java switches always jump to computed offsets. If you can't jump based on an integer Java won't support your type. This is why it took so long to get String based switches. They had to set in stone how Strings compute hash codes so that offsets could be pre-computed based on absolutely known string hash codes.

  - Groovy switches are driven off of the isCase operator. This means a switch statement is just a series of calls to the isCase method. This is really slow.

  - Solution: Use if/else and fast tests for a small number of tests. For large numbers of tests use fast value types and maps.

- [ ] Gotcha #6: Using ==

  - Calling '==' is very slow, but oddly enough calling equals() is very fast. Huh?

  - Calling '==' results in a call to ScriptBytecodeAdapter.compareEqual() which appears to be the culprit in making things slow.

  - This appears to be a change from a few years ago. If I remember correctly calling equals() explicitly used to result in a call to ScriptBytecodeAdapter.compareEqual(), even in @CompileStatic mode. At least now there is this escape hatch if needed, though I probably won't remember to use it.

  - The actual implementation in Groovy of equals() is quite performant, meaning Groovy classes will be performant in collection types.
    
- [ ] Gotcha #7: Using out of bounds indexes for arrays/lists

  - This is implemented by catching ArrayIndexOutOfBoundsException, then re-trying with a re-mapped index.

  - I didn't measure this but it just looks slow. In fact I don't see how could it be anything but slower than normal array/list access.

- [ ] Audience participation

  - What have you seen?

  - Acutal measured slowness is preferred to vague intuitions, which are often wrong in dealing with code.

