presentation.tex

\section{Groovy Annotations for Speed (Use the Good) [0/8]}
\label{sec:orgheadline6}

\begin{itemize}
\item $\square$ @CompileStatic

\begin{itemize}
\item If there is a single thing you remember from this talk it should be use @CompileStatic as a first step when you have an application performance problem.

\item This annotation removes a lot of the dynamicity of Groovy. Properties and methods must be resolvable at compile time, no use of propertyMissing/methodMissing. Types must match. Groovy extension methods such as find/findAll/each are legal. Groovy style casting is legal. Groovy code with @CompileStatic enabled looks a lot like Kotlin code.
\end{itemize}

\item $\square$ @TypeChecked

\begin{itemize}
\item Does all of the type checking @CompileStatic does and the same rules apply.

\item However it doesn't do static compilation, just the type checking part, so @TypeCheck'ed code won't actually run any faster than normal Groovy code. So why did I include this?

\item @TypeChecked does prevent dispatch based on propertyMissing/methodMissing which is extraordinarily slow.
\end{itemize}

\item $\square$ @Lazy

\begin{itemize}
\item Only initializes a property if it is called; it's a simple one item cache.

\item With volatile it correctly implements double checked locking, which most people don't get right.

\item Very useful for objects which have expensive calls which are not always needed. I've used this extensively for templates with conditional logic. The conditional logic means that some properties are not needed and should not be computed.
\end{itemize}

\item $\square$ @Memoized

\begin{itemize}
\item Caches invocations of your method by adding a hidden map to your class

\item If you have not invoked your method with a particular set of parameters, the logic of your method is called, the parameters are added as keys of the hidden map, and the returned value is added as the value of those keys

\item If you have invoked your method with a particular set of parameters, the parameters are used as the key to look up the correct return value in the cache

\item Is a simple, somewhat tunable cache. For simple use cases it gets the job done
\end{itemize}

\item $\square$ @Immutable

\begin{itemize}
\item Doesn't make your code faster by itself, but does allow you to do fast things with your class

\item @Immutable classes are inherently thread safe, multi-threading can substantially improve performance

\item @Immutable classes also have correct equals() and hashCode() methods. This means they can be used as keys in maps or added to sets. This means that you can eliminate linear search algorithms O(n) with hash based O(1) algorithms
\end{itemize}

\item $\square$ @Sortable

\begin{itemize}
\item Again, it doesn't make your code faster by itself, by does allow you to do fast things with your class

\item @Sortable code is usable in SortedSet, meaning O(n/2) searches become O(ln n) searches

\item @Sortable code is usable in NavigableSet, meaning range searches are now cheap and easy
\end{itemize}

\item $\square$ @TailRecursive

\begin{itemize}
\item Specialized, if you don't know what tail recursion is, ignore this for now.

\item If your method is most naturally expressed as a recursion, use this to convert the method to iteration
\end{itemize}

\item $\square$ @Slf4j and friends in groovy.util.logging

\begin{itemize}
\item Lots of logging can lead to performance degradation if the logging is done incorrectly

\item Parametrized logging is NOT a valid solution IMNSHO. It doesn't work in all cases and can lead to unnecessary array creation

\item The only way to log correctly is to use log guard statements consistently, like: if(log.isDebugEnabled()) \{ log.debug(\ldots{}) \}, this is of course a lot of typing, easy to forget, and just plain ugly

\item The Groovy logging annotations give you that for free, they do the right thing every time.
\end{itemize}
\end{itemize}

\section{What makes these annotations work and can I do the same thing [0/2]}
\label{sec:orgheadline7}

\begin{itemize}
\item $\square$ The secret is code injection, re-arranging, and re-writing your code

\begin{itemize}
\item @Lazy, @Memoized, and @Slf4j wrap code around your code. The semantics are the same, the JVM will just execute it more efficiently

\item @Sortable and @Immutable add code to your code to enforce semantics of immutability and comparability

\item @TailRecursive re-writes your code to be iterative instead of recursive

\item @CompileStatic generates different byte code than normal groovy code
\end{itemize}

\item $\square$ You can absolutely do the same thing
\end{itemize}

\section{Let's do what Groovy does! (Create the Great) [0/4]}
\label{sec:orgheadline8}

\begin{itemize}
\item $\square$ Re-arrange code at runtime with builders

\begin{itemize}
\item See Grades.groovy

\item Dynamic groovy code is usually the easiest and most natural way to express something

\item However, it may not lead to the most efficient execution

\item Solution: combine easy Groovy syntax with uglier execution, using a builder as your bridge between the two
\end{itemize}

\item $\square$ Compile using the Groovy Class Loader (GCL)

\begin{itemize}
\item See Functions.compile

\item Basic idea is that you have a string representation of code and you also have a groovy compiler at all times, make use of both to turn strings into executable code

\item Can also be used to load/reload and optimize scripts at runtime

\item Use this version if you need access to actual class produced
\end{itemize}

\item $\square$ Compile using the Groovy Shell

\begin{itemize}
\item See Functions.fromScript

\item Similar to GCL trick. Really it's exactly the same thing since they underneath the covers are doing the same thing.

\item Like GCL the basic problem you are trying to solve is that you need to defer optimization to runtime, but you do want to use the static compiler.

\item Safer than GCL since you can use Secure AST transformations to restrict code being run

\item Don't write parsers, write Groovy DSL's, compile them using the Groovy Shell and write your DSL engines to optimize the code that executes.
\end{itemize}

\item $\square$ Transform your code using AST Transformations

\begin{itemize}
\item Beyond the scope of this presentation. I have a presentation I have given in the past, check out my github repo on AST transformations.

\item Basic idea: You want to give the Groovy compiler code other than the one you wrote. Maybe you want to pre-compute something or you want the compiler to generate code based on the code you have written (compile time meta-programming).

\item Idea \#1: A better caching library than @Memoized.

\item Idea \#2: Minimal Perfect Hashing: Guarantee that hashCode() produces collision free hash codes if the set of objects is known at compile time.

\item Idea \#3: Binary parsers/encoder generated based on data known at compile time.

\item Idea \#4: Go crazy with Cedric, embed java byte code via Groovy AST transforms: \url{https://github.com/melix/groovy-bytecode-ast}. I've been wanting to try this myself.
\end{itemize}
\end{itemize}
