presentation.org
* Tools For Diagnosing Groovy Performance Problems [0/5]

- [ ] YourKit https://www.yourkit.com

  - Best JVM profiler out there.

  - Tells you exactly where your code is slow

  - However, it's pricey, but free for open source projects

- [ ] VisualVM https://visualvm.java.net/

  - If you don't have access to YourKit, this gives basic information about in memory JVM behavior

  - Tells you your code is slow, doesn't help as much in locating where it is slow

  - Generally comes with Oracle JDK's these days. OpenJDK may or may not have it.

- [ ] JD-GUI http://jd.benow.ca/

  - Best Java bytecode decompiler out there

  - Tells you what a JVM thinks your code look like

  - Great a looking for extra/slow code the Groovy compiler is injecting. As a generalization, the less comprehensible and the uglier your decompiled code is, the worse it will perform. However, this is not a guarantee and exceptions abound.

- [ ] JIT Watch https://github.com/AdoptOpenJDK/jitwatch

  - Tells you what the JVM is doing to your code at runtime.

  - Is your code being compiled to native code? Is your code getting inlined? What's the runtime call graph of your methods? JIT Watch can answer all of these questions, which are critical in understanding why your code is fast or slow.

- [ ] Java Bytecode Editor http://set.ee/jbe/

  - Valuable for looking at what bytecode is in your class files

  - If you do performance work, you eventually have to start looking at bytecode



#+STARTUP: indent
#+TITLE: Groovy Performance: Avoid the Bad, Use the Good, Create the Great
* How do I apply this stuff? [0/2]

- [ ] A lot of these tricks remove a lot of the "Groovyness" out of Groovy. Your code can end up looking like mostly Java code.

- [ ] Good application architecture

  - Bottom layer of your application/library should be a performant engine that makes heavy use of @CompileStatic or Java code

    - This layer should be mostly hidden from users of your library

    - If you need to expose pieces of this part to users, only expose interfaces or abstract classes, you need the ability to change the internals without people depending on details. It's also best if what you expose it immutable.

    - Unit test this layer like crazy, if something goes wrong here, it will be a huge problem

  - Middle layer is for business logic and I/O code

    - No need to @CompileStatic, but @TypeChecked code can be useful here

    - I/O is generally an order of magnitude slower than the slowest Groovy code, so don't bother speeding things up

    - Write clean and idiomatic Groovy here

    - This is the layer an application developer should work at

  - Top Layer is for scripting, DSL's, configuration, and more idiomatic Groovy

    - This is the public API for your application, this is what people should think of when they think about your application

    - Use any dynamic tricks your want here, this code gets executed very few times

    - This is where you show how cool Groovy is
