presentation.tex

\section{Tools For Diagnosing Groovy Performance Problems [0/5]}
\label{sec:orgheadline9}

\begin{itemize}
\item $\square$ YourKit \url{https://www.yourkit.com}

\begin{itemize}
\item Best JVM profiler out there.

\item Tells you exactly where your code is slow

\item However, it's pricey, but free for open source projects
\end{itemize}

\item $\square$ VisualVM \url{https://visualvm.java.net/}

\begin{itemize}
\item If you don't have access to YourKit, this gives basic information about in memory JVM behavior

\item Tells you your code is slow, doesn't help as much in locating where it is slow

\item Generally comes with Oracle JDK's these days. OpenJDK may or may not have it.
\end{itemize}

\item $\square$ JD-GUI \url{http://jd.benow.ca/}

\begin{itemize}
\item Best Java bytecode decompiler out there

\item Tells you what a JVM thinks your code look like

\item Great a looking for extra/slow code the Groovy compiler is injecting. As a generalization, the less comprehensible and the uglier your decompiled code is, the worse it will perform. However, this is not a guarantee and exceptions abound.
\end{itemize}

\item $\square$ JIT Watch \url{https://github.com/AdoptOpenJDK/jitwatch}

\begin{itemize}
\item Tells you what the JVM is doing to your code at runtime.

\item Is your code being compiled to native code? Is your code getting inlined? What's the runtime call graph of your methods? JIT Watch can answer all of these questions, which are critical in understanding why your code is fast or slow.
\end{itemize}

\item $\square$ Java Bytecode Editor \url{http://set.ee/jbe/}

\begin{itemize}
\item Valuable for looking at what bytecode is in your class files

\item If you do performance work, you eventually have to start looking at bytecode
\end{itemize}
\end{itemize}
\section{How do I apply this stuff? [0/2]}
\label{sec:orgheadline10}

\begin{itemize}
\item $\square$ A lot of these tricks remove a lot of the "Groovyness" out of Groovy. Your code can end up looking like mostly Java code.

\item $\square$ Good application architecture

\begin{itemize}
\item Bottom layer of your application/library should be a performant engine that makes heavy use of @CompileStatic or Java code

\begin{itemize}
\item This layer should be mostly hidden from users of your library

\item If you need to expose pieces of this part to users, only expose interfaces or abstract classes, you need the ability to change the internals without people depending on details. It's also best if what you expose it immutable.

\item Unit test this layer like crazy, if something goes wrong here, it will be a huge problem
\end{itemize}

\item Middle layer is for business logic and I/O code

\begin{itemize}
\item No need to @CompileStatic, but @TypeChecked code can be useful here

\item I/O is generally an order of magnitude slower than the slowest Groovy code, so don't bother speeding things up

\item Write clean and idiomatic Groovy here

\item This is the layer an application developer should work at
\end{itemize}

\item Top Layer is for scripting, DSL's, configuration, and more idiomatic Groovy

\begin{itemize}
\item This is the public API for your application, this is what people should think of when they think about your application

\item Use any dynamic tricks your want here, this code gets executed very few times

\item This is where you show how cool Groovy is
\end{itemize}
\end{itemize}
\end{itemize}
\end{document}
